In [3]:

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:

%sql sqlite://

In [21]:
%%sql
CREATE TABLE USUARIO
(COD_USUA VARCHAR(6) NOT NULL,
NOM_USUA CHAR (25) NOT NULL,
COD_EST VARCHAR (25) NOT NULL);

 * sqlite://
(sqlite3.OperationalError) table USUARIO already exists
[SQL: CREATE TABLE USUARIO
(COD_USUA VARCHAR(6) NOT NULL,
NOM_USUA CHAR (25) NOT NULL,
COD_EST VARCHAR (25) NOT NULL);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [25]:
%sql SELECT *FROM USUARIO;

 * sqlite://
Done.

[]

In [37]:
%%sql 
INSERT INTO USUARIO VALUES('U00001' , 'LUIS','ACTIVO');
INSERT INTO USUARIO VALUES('U00002' , 'JANO','ACTIVO');
INSERT INTO USUARIO VALUES('U00003' , 'FRANK','INACACTIVO');
INSERT INTO USUARIO VALUES('U00004' , 'LEO','ACTIVO');
INSERT INTO USUARIO VALUES('U00005' , 'JESUS','NULL');
INSERT INTO USUARIO VALUES('U00006' , 'SONIA','ACTIVO');
INSERT INTO USUARIO VALUES('U00007' , 'LESLIE','INACTIVO');
INSERT INTO USUARIO VALUES('U00008' , 'LIZU','ACTIVO');
INSERT INTO USUARIO VALUES('U00009' , 'JOEL','NULL');
INSERT INTO USUARIO VALUES('U00010' , 'BEATRIZ','ACTIVO');
INSERT INTO USUARIO VALUES('U00011' , 'CARLOS','INACTIVO');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [39]:
%sql SELECT *FROM USUARIO;

 * sqlite://
Done.

[('U00001', 'LUIS', 'ACTIVO'),
 ('U00002', 'JANO', 'ACTIVO'),
 ('U00003', 'FRANK', 'INACACTIVO'),
 ('U00004', 'LEO', 'ACTIVO'),
 ('U00005', 'JESUS', 'NULL'),
 ('U00006', 'SONIA', 'ACTIVO'),
 ('U00007', 'LESLIE', 'INACTIVO'),
 ('U00008', 'LIZU', 'ACTIVO'),
 ('U00009', 'JOEL', 'NULL'),
 ('U00010', 'BEATRIZ', 'ACTIVO'),
 ('U00011', 'CARLOS', 'INACTIVO')]

In [56]:
%%sql
DELETE FROM USUARIO WHERE NOM_USUA= 'JOEL';

 * sqlite://
1 rows affected.

[]

In [62]:
%sql SELECT *FROM USUARIO;

 * sqlite://
Done.

[('U00001', 'LUIS', 'ACTIVO'),
 ('U00002', 'JANO', 'ACTIVO'),
 ('U00003', 'FRANK', 'INACACTIVO'),
 ('U00004', 'LEO', 'ACTIVO'),
 ('U00005', 'JESUS', 'NULL'),
 ('U00006', 'SONIA', 'ACTIVO'),
 ('U00007', 'LESLIE', 'INACTIVO'),
 ('U00008', 'LIZU', 'ACTIVO'),
 ('U00010', 'BEATRIZ', 'ACTIVO'),
 ('U00011', 'CARLOS', 'INACTIVO')]

In [65]:
Algoritmo problema1
	valor <- 4.0*5
	Escribir "el valor es: " valor
	
	valor <- 3.0^2.0 -2.0
	valor <- 5.0 -2.0
	Escribir  "el valor es: " valor
	
	valor <- 5
	x<- 3
	valor <- valor * x
	Escribir "el valor es: " valor 
FinAlgoritmo

SyntaxError: invalid syntax (3895469051.py, line 1)